Table of Contents
 Interface IIdeaBend
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
Represent bend of folded plate
public interface IIdeaBend : IIdeaObject
Inherited Members
 IIdeaObject.Id
 IIdeaObject.Name
Properties
 EndFaceNormal
End Face Normal
IdeaVector3D EndFaceNormal { get; }
Property Value
IdeaVector3D
 LineOnSideBoundary1
Line on side of bend boundary
IIdeaLineSegment3D LineOnSideBoundary1 { get; }
Property Value
IIdeaLineSegment3D
 LineOnSideBoundary2
Line on other side of bend boundary
IIdeaLineSegment3D LineOnSideBoundary2 { get; }
Property Value
IIdeaLineSegment3D
 Plate1
first plate
IIdeaPlate Plate1 { get; }
Property Value
IIdeaPlate
 Plate2
second plate
IIdeaPlate Plate2 { get; }
Property Value
IIdeaPlate
 Radius
Radius
double Radius { get; }
Property Value
double
 Edit this page